//---------------------------------------------------------------------------
// 2025 STL 화56목78	 6월 10일 화요일							(14주 1일)
// 6월 19일 목요일 15주 2일 - 기말시험
//---------------------------------------------------------------------------
// Algorithms - cppreference
//-----------------------------------------------------	----------------------

#include <iostream>
#include "save.h"
#include "STRING.h"
using namespace std;

extern bool 관찰;					// 관찰하려면 true로 설정

//--------
int main()
//--------
{
	// 다음 시간에 sorting 관련 알고리즘 이해
	string s{ "2025. 6. 10" };

	// 이것도 살리고.
	while (true) {
		cout << s << endl;
		// 100ms 쉬고
		rotate(s.begin(), s.end(), s.begin() + 1);
	}

	save("메인.cpp");
} 